Looking happy to me after those changes:

```
Terraform will perform the following actions:

  # module.quasar.aws_cloudwatch_log_group.log_group will be created
  + resource "aws_cloudwatch_log_group" "log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/papertrail"
      + retention_in_days = 14
    }

  # module.quasar.aws_cloudwatch_log_subscription_filter.papertrail_subscription will be created
  + resource "aws_cloudwatch_log_subscription_filter" "papertrail_subscription" {
      + destination_arn = "*****"
      + distribution    = "ByLogStream"
      + id              = (known after apply)
      + log_group_name  = "/aws/lambda/papertrail"
      + name            = "papertrail_forwarder"
      + role_arn        = (known after apply)
    }

  # module.quasar.aws_ec2_client_vpn_endpoint.quasar-vpn-endpoint will be created
  + resource "aws_ec2_client_vpn_endpoint" "quasar-vpn-endpoint" {
      + client_cidr_block      = "172.22.0.0/22"
      + description            = "Quasar-Client-VPN"
      + dns_name               = (known after apply)
      + id                     = (known after apply)
      + server_certificate_arn = "*****"
      + split_tunnel           = true
      + status                 = (known after apply)
      + transport_protocol     = "udp"

      + authentication_options {
          + root_certificate_chain_arn = "*****"
          + type                       = "certificate-authentication"
        }

      + connection_log_options {
          + cloudwatch_log_group = "/aws/lambda/papertrail"
          + enabled              = true
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```